app/controllers/home_controller.rb

  def index
    @products = Product.includes(:images).all
---
SELECT "images".* FROM "images" WHERE "images"."product_id" IN (1, 2, 3, 4, 5)
SELECT "products".* FROM "products"